//------------------------------------------------------------//
// class 복사
// extends 사용
//------------------------------------------------------------//

class 클래스원본{
    x = 10;
}

class 클래스복사 extends 클래스원본{
}

let 클래스확인 = new 클래스복사();
console.log(클래스확인); //클래스복사  x: 10  [[Prototype]]: 클래스원본

//------------------------------------------------------------//


class User10 {
    private static x = 10;
    public static y = 20;
    z = 10;
}
    
let 클래스확인1 = new User10();
console.log(클래스확인1); // static 사용하면 자식들 물려주지 않음
console.log(User10.y); // static 사용해서 접근하려면 User10.y 로 접근해야함



